y_connector/y-piece_r0.76mm_bg5mlpmin_in6.6mlpmin_05cm_bg1cm_p5cm/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// adapted from https://github.com/OpenFOAM/OpenFOAM-2.2.x/blob/master/applications/utilities/surface/surfaceFeatureExtract/surfaceFeatureExtractDict

//y_connector.stl
//{
//    // How to obtain raw features (extractFromFile || extractFromSurface)
//    extractionMethod    extractFromSurface;
//
//    extractFromSurfaceCoeffs
//    {
//        // Mark edges whose adjacent surface normals are at an angle less
//        // than includedAngle as features
//        // - 0  : selects no edges
//        // - 180: selects all edges
//        includedAngle   150; // in YouTube tutorial: 150…
//    }
//
//    // Write options
//
//    // Write features to obj format for postprocessing
//    writeObj yes;
//}

backgroundInletPatch.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs
    {includedAngle 150;}
    writeObj yes;
}
particleInletPatch.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs
    {includedAngle 150;}
    writeObj yes;
}
outletPatch.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs
    {includedAngle 150;}
    writeObj yes;
}
yConnectorPatch.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs
    {includedAngle 150;}
    writeObj yes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
